Masmiseim36/nxpSDK/devices/MKW39A4/drivers/fsl_dspi_edma.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_dspi_edma.h"

/***********************************************************************************************************************
 * Definitions
 ***********************************************************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dspi_edma"
#endif

/*!
 * @brief Structure definition for dspi_master_edma_private_handle_t. The structure is private.
 */
typedef struct _dspi_master_edma_private_handle
{
    SPI_Type *base;                    /*!< DSPI peripheral base address. */
    dspi_master_edma_handle_t *handle; /*!< dspi_master_edma_handle_t handle */
} dspi_master_edma_private_handle_t;

/*!
 * @brief Structure definition for dspi_slave_edma_private_handle_t. The structure is private.
 */
typedef struct _dspi_slave_edma_private_handle
{
    SPI_Type *base;                   /*!< DSPI peripheral base address. */
    dspi_slave_edma_handle_t *handle; /*!< dspi_master_edma_handle_t handle */
} dspi_slave_edma_private_handle_t;

/***********************************************************************************************************************
 * Prototypes
 ***********************************************************************************************************************/
/*!
 * @brief DSPI check whether the transfer size exceed the maximum size EDMA can provide.
 *
 * @param base DSPI peripheral base address.
 * @param transfer A pointer to the dspi_transfer_t structure.
 * @param bitsPerFrame Bits per frame, minimum 4, maximum 16.
 * @return status of status_t.
 */
static status_t DSPI_CheckTransferSize(SPI_Type *base, dspi_transfer_t *transfer, uint32_t bitsPerFrame);

/*!
 * @brief DSPI master prepares the handle structure for EDMA transfer.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_master_edma_handle_t structure which stores the transfer state.
 * @param transfer A pointer to the dspi_transfer_t structure.
 */
static void DSPI_MasterPrepareTransferEDMA(SPI_Type *base,
                                           dspi_master_edma_handle_t *handle,
                                           dspi_transfer_t *transfer);

/*!
 * @brief DSPI master prepares the first data to send using EDMA.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_master_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_MasterPrepareFirstDataEDMA(SPI_Type *base, dspi_master_edma_handle_t *handle);

/*!
 * @brief DSPI master prepares the last data to send using EDMA.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_master_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_MasterPrepareLastDataEDMA(SPI_Type *base, dspi_master_edma_handle_t *handle);

/*!
 * @brief DSPI master configure channel_A for receive.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_master_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_MasterConfigReceiveEDMA(SPI_Type *base, dspi_master_edma_handle_t *handle);

/*!
 * @brief DSPI master configure intermediate TCD for send.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_master_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_MasterConfigIntermediateEDMA(SPI_Type *base, dspi_master_edma_handle_t *handle);

/*!
 * @brief DSPI master configure channel_B and channel_C for send.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_master_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_MasterConfigSendEDMA(SPI_Type *base, dspi_master_edma_handle_t *handle);

/*!
 * @brief DSPI master set the EDMA channel priority for the 3 channels for the transfer.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_master_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_MasterSetEDMATransferChannelPriority(SPI_Type *base, dspi_master_edma_handle_t *handle);

/*!
 * @brief EDMA_DspiMasterCallback after the DSPI master transfer completed by using EDMA.
 * This is not a public API.
 */
static void EDMA_DspiMasterCallback(edma_handle_t *edmaHandle,
                                    void *g_dspiEdmaPrivateHandle,
                                    bool transferDone,
                                    uint32_t tcds);

/*!
 * @brief DSPI slave prepares the handle structure for EDMA transfer.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_slave_edma_handle_t structure which stores the transfer state.
 * @param transfer A pointer to the dspi_transfer_t structure.
 */
static void DSPI_SlaverPrepareTransferEDMA(SPI_Type *base, dspi_slave_edma_handle_t *handle, dspi_transfer_t *transfer);

/*!
 * @brief DSPI slave prepares the first data to send using EDMA.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_slave_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_SlavePrepareFirstDataEDMA(SPI_Type *base, dspi_slave_edma_handle_t *handle);

/*!
 * @brief DSPI slave configure channel_A for receive.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_slave_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_SlaveConfigReceiveEDMA(SPI_Type *base, dspi_slave_edma_handle_t *handle);

/*!
 * @brief DSPI slave configure channel_B for send.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_slave_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_SlaveConfigSendEDMA(SPI_Type *base, dspi_slave_edma_handle_t *handle);

/*!
 * @brief DSPI slave set the EDMA channel priority for the 2 channels for the transfer.
 *
 * @param base DSPI peripheral base address.
 * @param handle A pointer to the dspi_slave_edma_handle_t structure which stores the transfer state.
 */
static void DSPI_SlaveSetEDMATransferChannelPriority(SPI_Type *base, dspi_slave_edma_handle_t *handle);

/*!
 * @brief EDMA_DspiSlaveCallback after the DSPI slave transfer completed by using EDMA.
 * This is not a public API.
 */
static void EDMA_DspiSlaveCallback(edma_handle_t *edmaHandle,
                                   void *g_dspiEdmaPrivateHandle,
                                   bool transferDone,
                                   uint32_t tcds);

