Masmiseim36/nxpSDK/devices/MKW39A4/drivers/fsl_dspi_edma.c
/***********************************************************************************************************************
 * Variables
 ***********************************************************************************************************************/

/*! @brief Pointers to dspi edma handles for each instance. */
static dspi_master_edma_private_handle_t s_dspiMasterEdmaPrivateHandle[FSL_FEATURE_SOC_DSPI_COUNT];
static dspi_slave_edma_private_handle_t s_dspiSlaveEdmaPrivateHandle[FSL_FEATURE_SOC_DSPI_COUNT];

/***********************************************************************************************************************
 * Code
 ***********************************************************************************************************************/

/*!
 * brief Initializes the DSPI master eDMA handle.
 *
 * This function initializes the DSPI eDMA handle which can be used for other DSPI transactional APIs.  Usually, for a
 * specified DSPI instance, call this API once to get the initialized handle.
 *
 * Note that DSPI eDMA has separated (RX and TX as two sources) or shared (RX  and TX are the same source) DMA request
 * source.
 * (1) For the separated DMA request source, enable and set the RX DMAMUX source for edmaRxRegToRxDataHandle and
 * TX DMAMUX source for edmaIntermediaryToTxRegHandle.
 * (2) For the shared DMA request source, enable and set the RX/RX DMAMUX source for the edmaRxRegToRxDataHandle.
 *
 * param base DSPI peripheral base address.
 * param handle DSPI handle pointer to dspi_master_edma_handle_t.
 * param callback DSPI callback.
 * param userData A callback function parameter.
 * param edmaRxRegToRxDataHandle edmaRxRegToRxDataHandle pointer to edma_handle_t.
 * param edmaTxDataToIntermediaryHandle edmaTxDataToIntermediaryHandle pointer to edma_handle_t.
 * param edmaIntermediaryToTxRegHandle edmaIntermediaryToTxRegHandle pointer to edma_handle_t.
 */
void DSPI_MasterTransferCreateHandleEDMA(SPI_Type *base,
                                         dspi_master_edma_handle_t *handle,
                                         dspi_master_edma_transfer_callback_t callback,
                                         void *userData,
                                         edma_handle_t *edmaRxRegToRxDataHandle,
                                         edma_handle_t *edmaTxDataToIntermediaryHandle,
                                         edma_handle_t *edmaIntermediaryToTxRegHandle)
{
    assert(NULL != handle);
    assert(NULL != edmaRxRegToRxDataHandle);
#if (!(defined(FSL_FEATURE_DSPI_HAS_GASKET) && FSL_FEATURE_DSPI_HAS_GASKET))
    assert(NULL != edmaTxDataToIntermediaryHandle);
#endif
    assert(NULL != edmaIntermediaryToTxRegHandle);

    /* Zero the handle. */
    (void)memset(handle, 0, sizeof(*handle));

    uint32_t instance = DSPI_GetInstance(base);

    s_dspiMasterEdmaPrivateHandle[instance].base   = base;
    s_dspiMasterEdmaPrivateHandle[instance].handle = handle;

    handle->callback = callback;
    handle->userData = userData;

    handle->edmaRxRegToRxDataHandle        = edmaRxRegToRxDataHandle;
    handle->edmaTxDataToIntermediaryHandle = edmaTxDataToIntermediaryHandle;
    handle->edmaIntermediaryToTxRegHandle  = edmaIntermediaryToTxRegHandle;
}

static status_t DSPI_CheckTransferSize(SPI_Type *base, dspi_transfer_t *transfer, uint32_t bitsPerFrame)
{
    status_t result       = (status_t)kStatus_Success;
    uint32_t limited_size = 0;
    /* If using a shared RX/TX DMA request, then this limits the amount of data we can transfer
     * due to the linked channel. The max bytes is 511 if 8-bit/frame or 1022 if 16-bit/frame
     */
    if (1 == FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(base))
    {
        limited_size = 32767u;
    }
    else
    {
        limited_size = 511u;
    }

    if (bitsPerFrame > 8U)
    {
        if (transfer->dataSize > (limited_size << 1u))
        {
            result = (status_t)kStatus_DSPI_OutOfRange;
        }
        /*The data size should be even if the bitsPerFrame is greater than 8 (that is 2 bytes per frame in dspi) */
        if (0U != (transfer->dataSize & 0x1U))
        {
            result = (status_t)kStatus_InvalidArgument;
        }
    }
    else
    {
        if (transfer->dataSize > limited_size)
        {
            result = (status_t)kStatus_DSPI_OutOfRange;
        }
    }

    return result;
}

static void DSPI_MasterPrepareTransferEDMA(SPI_Type *base, dspi_master_edma_handle_t *handle, dspi_transfer_t *transfer)
{
    assert(NULL != handle);
    assert(NULL != transfer);

    uint32_t tmpMCR                          = 0;
    dspi_command_data_config_t commandStruct = {false, (uint8_t)kDSPI_Ctar0, (uint8_t)kDSPI_Pcs0, false, false};
    uint8_t dummyData                        = DSPI_GetDummyDataInstance(base);

    DSPI_StopTransfer(base);
    DSPI_DisableInterrupts(base, (uint32_t)kDSPI_AllInterruptEnable);
    DSPI_FlushFifo(base, true, true);
    DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_AllStatusFlag);
    DSPI_DisableDMA(base, (uint32_t)kDSPI_RxDmaEnable | (uint32_t)kDSPI_TxDmaEnable);

    commandStruct.whichPcs =
        (uint8_t)(1UL << ((transfer->configFlags & DSPI_MASTER_PCS_MASK) >> DSPI_MASTER_PCS_SHIFT));
    commandStruct.isEndOfQueue       = false;
    commandStruct.clearTransferCount = false;
    commandStruct.whichCtar = (uint8_t)((transfer->configFlags & DSPI_MASTER_CTAR_MASK) >> DSPI_MASTER_CTAR_SHIFT);
    commandStruct.isPcsContinuous =
        (0U != (transfer->configFlags & (uint32_t)kDSPI_MasterPcsContinuous)) ? true : false;
    handle->command = DSPI_MasterGetFormattedCommand(&(commandStruct));

    commandStruct.isEndOfQueue = true;
    commandStruct.isPcsContinuous =
        (0U != (transfer->configFlags & (uint32_t)kDSPI_MasterActiveAfterTransfer)) ? true : false;
    handle->lastCommand = DSPI_MasterGetFormattedCommand(&(commandStruct));

    handle->bitsPerFrame = ((base->CTAR[commandStruct.whichCtar] & SPI_CTAR_FMSZ_MASK) >> SPI_CTAR_FMSZ_SHIFT) + 1U;

    tmpMCR = base->MCR;
    if ((0U != (tmpMCR & SPI_MCR_DIS_RXF_MASK)) || (0U != (tmpMCR & SPI_MCR_DIS_TXF_MASK)))
    {
        handle->fifoSize = 1;
    }
    else
    {
        handle->fifoSize = FSL_FEATURE_DSPI_FIFO_SIZEn(base);
    }
    handle->txData                    = transfer->txData;
    handle->rxData                    = transfer->rxData;
    handle->remainingSendByteCount    = transfer->dataSize;
    handle->remainingReceiveByteCount = transfer->dataSize;
    handle->totalByteCount            = transfer->dataSize;
    handle->txBuffIfNull              = ((uint32_t)dummyData << 8U) | dummyData;
}

static void DSPI_MasterPrepareFirstDataEDMA(SPI_Type *base, dspi_master_edma_handle_t *handle)
{
    uint16_t wordToSend;
    uint8_t byteCountEachSend;
    uint32_t currentCmd;
    uint8_t dummyData = DSPI_GetDummyDataInstance(base);

    /*If dspi has separate dma request , prepare the first data in 'intermediary',
      otherwise, that is dspi has shared dma request, send first 2 data if there is fifo
      or send first 1 data if there is no fifo
    */
    if (1 == FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(base))
    {
        /* For DSPI instances with separate RX/TX DMA requests, we'll use the TX DMA request to
         * trigger the TX DMA channel and RX DMA request to trigger the RX DMA channel
         */
        /*Prepare the firt data*/
        if (handle->bitsPerFrame > 8U)
        {
            if (NULL != handle->txData)
            {
                wordToSend = *(handle->txData);
                ++handle->txData; /* increment to next data byte */
                wordToSend |= (uint16_t)(*(handle->txData)) << 8U;
                if (handle->remainingSendByteCount > 2U)
                {
                    ++handle->txData; /* increment to next data byte */
                }
            }
            else
            {
                wordToSend = (((uint16_t)dummyData << 8U) | (uint16_t)dummyData);
            }
            byteCountEachSend = 2U;
        }
        /* Optimized for bits/frame less than or equal to one byte. */
        else
        {
            if (NULL != handle->txData)
            {
                wordToSend = *(handle->txData);
                /* increment to next data word*/
                ++handle->txData;
            }
            else
            {
                wordToSend = dummyData;
            }
            byteCountEachSend = 1U;
        }
        /* If it's the last word */
        if (handle->remainingSendByteCount <= byteCountEachSend)
        {
            handle->lastCommand = (handle->lastCommand & 0xffff0000U) | wordToSend;
            handle->command     = handle->lastCommand;
        }
        /* For all words except the last word , frame > 8bits */
        else
        {
            handle->command = (handle->command & 0xffff0000U) | wordToSend;
        }
    }
    /*dspi has shared dma request*/
    else
    {
        /* For DSPI instances with shared RX/TX DMA requests, we'll use the RX DMA request to
         * trigger ongoing transfers and link it to the TX DMA channel.
         */
        uint8_t dataAlreadyFed = 0;
        uint8_t dataFedMax     = 2;

        /* If bits/frame is greater than one byte */
        if (handle->bitsPerFrame > 8U)
        {
            currentCmd = handle->command;
            while (0U != (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_TxFifoFillRequestFlag))
            {
                /* For the last word */
                if (handle->remainingSendByteCount <= 2U)
                {
                    currentCmd = handle->lastCommand;
                }
                /* For all words */
                if (NULL != handle->txData)
                {
                    wordToSend = *(handle->txData);
                    ++handle->txData;
                    wordToSend |= (uint16_t)(*(handle->txData)) << 8U;
                    if (handle->remainingSendByteCount > 2U)
                    {
                        ++handle->txData;
                    }
                }
                else
                {
                    wordToSend = (((uint16_t)dummyData << 8U) | (uint16_t)dummyData);
                }
                if (handle->remainingSendByteCount > 2U)
                {
                    handle->remainingSendByteCount -= 2U;
                }
                else
                {
                    handle->remainingSendByteCount = 0U;
                }
                base->PUSHR = (currentCmd & 0xffff0000U) | wordToSend;

