Masmiseim36/nxpSDK/devices/MKW39A4/drivers/fsl_dspi_edma.c
                /* Try to clear the TFFF; if the TX FIFO is full this will clear */
                DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);

                dataAlreadyFed++;

                /* Exit loop if send count is zero, else update local variables for next loop */
                if ((handle->remainingSendByteCount == 0U) || (dataAlreadyFed == dataFedMax))
                {
                    break;
                }
            } /* End of TX FIFO fill while loop */
        }
    }
}

static void DSPI_SlaveConfigReceiveEDMA(SPI_Type *base, dspi_slave_edma_handle_t *handle)
{
    /* channel_A *** used for carry the data from Rx_Data_Register(POPR) to User_Receive_Buffer*/
    uint32_t rxAddr = DSPI_GetRxRegisterAddress(base);
    edma_transfer_config_t transferConfigA;

    EDMA_ResetChannel(handle->edmaRxRegToRxDataHandle->base, handle->edmaRxRegToRxDataHandle->channel);

    transferConfigA.srcAddr   = (uint32_t)rxAddr;
    transferConfigA.srcOffset = 0;

    if (NULL != handle->rxData)
    {
        transferConfigA.destAddr   = (uint32_t) & (handle->rxData[0]);
        transferConfigA.destOffset = 1;
    }
    else
    {
        transferConfigA.destAddr   = (uint32_t) & (handle->rxBuffIfNull);
        transferConfigA.destOffset = 0;
    }

    transferConfigA.destTransferSize = kEDMA_TransferSize1Bytes;

    if (handle->bitsPerFrame <= 8U)
    {
        transferConfigA.srcTransferSize = kEDMA_TransferSize1Bytes;
        transferConfigA.minorLoopBytes  = 1;
        transferConfigA.majorLoopCounts = handle->remainingReceiveByteCount;
    }
    else
    {
        transferConfigA.srcTransferSize = kEDMA_TransferSize2Bytes;
        transferConfigA.minorLoopBytes  = 2;
        transferConfigA.majorLoopCounts = handle->remainingReceiveByteCount / 2U;
    }

    /* Store the initially configured eDMA minor byte transfer count into the DSPI handle */
    handle->nbytes = (uint8_t)(transferConfigA.minorLoopBytes);

    EDMA_SetTransferConfig(handle->edmaRxRegToRxDataHandle->base, handle->edmaRxRegToRxDataHandle->channel,
                           (const edma_transfer_config_t *)(uint32_t)&transferConfigA, NULL);
    EDMA_EnableChannelInterrupts(handle->edmaRxRegToRxDataHandle->base, handle->edmaRxRegToRxDataHandle->channel,
                                 (uint32_t)kEDMA_MajorInterruptEnable);
    EDMA_StartTransfer(handle->edmaRxRegToRxDataHandle);
}

static void DSPI_SlaveConfigSendEDMA(SPI_Type *base, dspi_slave_edma_handle_t *handle)
{
    /***channel_B *** used for carry the data from User_Send_Buffer to Tx_Data_Register(PUSHR_SLAVE)*/
    uint32_t txAddr   = DSPI_SlaveGetTxRegisterAddress(base);
    uint8_t dummyData = DSPI_GetDummyDataInstance(base);
    edma_transfer_config_t transferConfigB;

    EDMA_ResetChannel(handle->edmaTxDataToTxRegHandle->base, handle->edmaTxDataToTxRegHandle->channel);

    transferConfigB.destAddr   = (uint32_t)txAddr;
    transferConfigB.destOffset = 0;

    if (NULL != handle->txData)
    {
        transferConfigB.srcAddr   = (uint32_t) & (handle->txData[0]);
        transferConfigB.srcOffset = 1;
    }
    else
    {
        transferConfigB.srcAddr   = (uint32_t) & (handle->txBuffIfNull);
        transferConfigB.srcOffset = 0;

        if (handle->bitsPerFrame <= 8U)
        {
            handle->txBuffIfNull = dummyData;
        }
        else
        {
            handle->txBuffIfNull = ((uint32_t)dummyData << 8U) | dummyData;
        }
    }

    transferConfigB.srcTransferSize = kEDMA_TransferSize1Bytes;

    if (handle->bitsPerFrame <= 8U)
    {
        transferConfigB.destTransferSize = kEDMA_TransferSize1Bytes;
        transferConfigB.minorLoopBytes   = 1;
        transferConfigB.majorLoopCounts  = handle->remainingSendByteCount;
    }
    else
    {
        transferConfigB.destTransferSize = kEDMA_TransferSize2Bytes;
        transferConfigB.minorLoopBytes   = 2;
        transferConfigB.majorLoopCounts  = handle->remainingSendByteCount / 2U;
    }

    EDMA_SetTransferConfig(handle->edmaTxDataToTxRegHandle->base, handle->edmaTxDataToTxRegHandle->channel,
                           (const edma_transfer_config_t *)(uint32_t)&transferConfigB, NULL);
    EDMA_StartTransfer(handle->edmaTxDataToTxRegHandle);
}

static void DSPI_SlaveSetEDMATransferChannelPriority(SPI_Type *base, dspi_slave_edma_handle_t *handle)
{
    /*Set channel priority*/
    edma_channel_Preemption_config_t preemption_config_t;
    uint8_t channelPriorityLow  = handle->edmaRxRegToRxDataHandle->channel;
    uint8_t channelPriorityHigh = handle->edmaTxDataToTxRegHandle->channel;
    uint8_t t                   = 0;

    if (channelPriorityLow > channelPriorityHigh)
    {
        t                   = channelPriorityLow;
        channelPriorityLow  = channelPriorityHigh;
        channelPriorityHigh = t;
    }

    preemption_config_t.enableChannelPreemption = true;
    preemption_config_t.enablePreemptAbility    = true;
    preemption_config_t.channelPriority         = channelPriorityLow;

    if (1 != FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(base))
    {
        EDMA_SetChannelPreemptionConfig(handle->edmaRxRegToRxDataHandle->base, handle->edmaRxRegToRxDataHandle->channel,
                                        (const edma_channel_Preemption_config_t *)(uint32_t)&preemption_config_t);

        preemption_config_t.channelPriority = channelPriorityHigh;
        EDMA_SetChannelPreemptionConfig(handle->edmaTxDataToTxRegHandle->base, handle->edmaTxDataToTxRegHandle->channel,
                                        (const edma_channel_Preemption_config_t *)(uint32_t)&preemption_config_t);
    }
    else
    {
        EDMA_SetChannelPreemptionConfig(handle->edmaTxDataToTxRegHandle->base, handle->edmaTxDataToTxRegHandle->channel,
                                        (const edma_channel_Preemption_config_t *)(uint32_t)&preemption_config_t);

        preemption_config_t.channelPriority = channelPriorityHigh;
        EDMA_SetChannelPreemptionConfig(handle->edmaRxRegToRxDataHandle->base, handle->edmaRxRegToRxDataHandle->channel,
                                        (const edma_channel_Preemption_config_t *)(uint32_t)&preemption_config_t);
    }

